In [1]:
import pandas as pd
import numpy as np
import requests
from bs4 import BeautifulSoup
import time
from splinter import Browser
import csv
import warnings
warnings.filterwarnings('ignore')

In [2]:
#url = 'https://www.remax.ca/ab/calgary-real-estate'
province_abb = input("Please enter the abbreviation of your province: ")
province_name = province_abb.lower()
city_name_input = input("Please enter city: ")
city_name = city_name_input.lower()
base_url = f'https://www.remax.ca/{province_name}/{city_name}-real-estate'
print(base_url)

Please enter the abbreviation of your province: on
Please enter city: toronto
https://www.remax.ca/on/toronto-real-estate

In [3]:
house_address = []
house_details = []


base_url = f'https://www.remax.ca/{province_name}/{city_name}-real-estate?page='
urls = [base_url + str(x) for x in range(1,300)]


for url in urls:
    
    #browser.visit(url)
#     time.sleep(5)

    # Parse HTML with Beautiful Soup
    response = requests.get(url)
    soup = BeautifulSoup(response.text, 'html.parser')
    time.sleep(5)

    addresses = soup.find_all('div', class_='left-content flex-one')
    for address in addresses:
        house_address.append(address.text)
        
    details = soup.find_all('div', class_='property-details')
    for detail in details:
        house_details.append(detail.text)

In [4]:
address_df = pd.DataFrame(house_address)

new_df = address_df[0].str.split(' ', 2, expand=True)
new_df["price"] = new_df[1].str.replace("$", "")
new_df["price"] = new_df["price"].str.replace(",", "")
new_df["price"] = pd.to_numeric(new_df["price"])

del new_df[0]
del new_df[1]
new_df.head()

                                               2   price
0   1411 - 101 ERSKINE AVE, Toronto, ON, M4P 0C5  535000
1   102 - 4 LITCHFIELD CRT, Toronto, ON, M9V 2A8  599900
2        2601 - 832 BAY ST, Toronto, ON, M5S 1Z6    2195
3       830 LAWRENCE AVE W, Toronto, ON, M6A 0B6    2075
4  1106 - 28 PEMBERTON AVE, Toronto, ON, M2M 4L1    2400

In [6]:
final_df = new_df[2].str.split(', Toronto, ON,', expand=True)
final_df.head()

                         0         1
0   1411 - 101 ERSKINE AVE   M4P 0C5
1   102 - 4 LITCHFIELD CRT   M9V 2A8
2        2601 - 832 BAY ST   M5S 1Z6
3       830 LAWRENCE AVE W   M6A 0B6
4  1106 - 28 PEMBERTON AVE   M2M 4L1

In [7]:
df_add = pd.concat([new_df, final_df], axis=1)
del df_add[2]
df_add.columns = ["price", "address", "postal_code"]
df_add.head()

    price                  address postal_code
0  535000   1411 - 101 ERSKINE AVE     M4P 0C5
1  599900   102 - 4 LITCHFIELD CRT     M9V 2A8
2    2195        2601 - 832 BAY ST     M5S 1Z6
3    2075       830 LAWRENCE AVE W     M6A 0B6
4    2400  1106 - 28 PEMBERTON AVE     M2M 4L1

In [8]:
details = pd.DataFrame(house_details)

details_df = details[0].str.split('|', expand=True)
details_df

del details_df[2]

details_df.columns = ["bedrooms", "bath", "property_type"]
details_df.head()

  bedrooms        bath property_type
0    1 bed      1 bath         condo
1    4 bed  1 + 1 bath         condo
2    1 bed      1 bath          None
3    1 bed      1 bath          None
4    2 bed      2 bath          None

In [9]:

toronto_df = pd.concat([df_add, details_df], axis=1)
toronto_df.head()

,price,address,postal_code,bedrooms,bath,property_type
0,535000,1411 - 101 ERSKINE AVE,M4P 0C5,1 bed,1 bath,condo
1,599900,102 - 4 LITCHFIELD CRT,M9V 2A8,4 bed,1 + 1 bath,condo
2,2195,2601 - 832 BAY ST,M5S 1Z6,1 bed,1 bath,None
3,2075,830 LAWRENCE AVE W,M6A 0B6,1 bed,1 bath,None
4,2400,1106 - 28 PEMBERTON AVE,M2M 4L1,2 bed,2 bath,None

In [10]:
toronto_df.drop_duplicates(inplace=True)
toronto_df.dropna(inplace=True)
len(toronto_df)

1643

In [11]:
toronto_df.to_csv('toronto_df.csv', encoding="utf-8", index=False)

In [12]:
toronto_df["price"].dtype

dtype('int64')

----

# Retrieving Walkscore for the postal codes in Calgary DataFrame

In [13]:
post_code_list = []

for i in toronto_df["postal_code"]:
    post_code_list.append(i)
    
len(post_code_list)

1643

post_code_list

In [14]:

scores_walk = []
scores_bike = []
scores_transit = []

for i in post_code_list:
    try:
        postal_code = i.replace(" ", "%20")
        url_score = "https://www.walkscore.com/score/" + str(postal_code)

        time.sleep(2)

        # Parse HTML with Beautiful Soup
        response = requests.get(url_score)
        code_soup = BeautifulSoup(response.text, 'html.parser')

 
        if 'pp.walk.sc/badge/walk/score' in str(code_soup):
            ws = str(code_soup).split('pp.walk.sc/badge/walk/score/')[1][:2].replace('.','')
            scores_walk.append(ws)
        else:
            ws = 'N/A'
            scores_walk.append(ws)
        if 'pp.walk.sc/badge/bike/score' in str(code_soup):
            bs = str(code_soup).split('pp.walk.sc/badge/bike/score/')[1][:2].replace('.','')
            scores_bike.append(bs)
        else:
            bs = 'N/A'
            scores_bike.append(bs)
        if 'pp.walk.sc/badge/transit/score' in str(code_soup):
            ts = str(code_soup).split('pp.walk.sc/badge/transit/score/')[1][:2].replace('.','')
            scores_transit.append(ts)
        else:
            ts = 'N/A'
            scores_transit.append(ts)
            
    except:
        ws = 'N/A'
        scores_walk.append(ws)
        bs = 'N/A'
        scores_bike.append(bs)
        ts = 'N/A'
        scores_transit.append(ts)

In [15]:
len(scores_transit)

1643

In [28]:
score_df_trans = {'postal_code': post_code_list, 'walk_score': scores_walk, 'bike_score': scores_bike, 'transit_score': scores_transit}
score_df_dup = pd.DataFrame(score_df_trans)
score_df = score_df_dup.drop_duplicates()
score_df.dropna(axis=0, inplace=True)
score_df.head()

  postal_code walk_score bike_score transit_score
0     M4P 0C5         77         73            82
1     M9V 2A8         41         50            74
2     M2M 4J4         76         57            99
3     M2R 0A4         48         68            66
4     M2K 0C1         52         56            69

In [30]:
score_df.drop(score_df.loc[score_df['walk_score']=="N/A"].index, inplace=True)
score_df.drop(score_df.loc[score_df['bike_score']=="N/A"].index, inplace=True)
score_df.drop(score_df.loc[score_df['transit_score']=="N/A"].index, inplace=True)

In [34]:
len(score_df)

1265

In [35]:
score_df.to_csv('score_df_tor.csv', encoding="utf-8", index=False)

In [36]:
from sqlalchemy import create_engine

In [37]:
rds_connection_string = "postgres:123@localhost:5432/realestate_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [24]:
engine.table_names()

['score', 'toronto', 'calgary']

In [38]:
toronto_df.to_sql(name= "toronto", 
                      con=engine, 
                      if_exists="append", 
                      index=False)

In [39]:
score_df.to_sql(name= "score", 
                      con=engine, 
                      if_exists="append", 
                      index=False)

In [41]:
import pymongo
from pymongo import MongoClient

from pandas.io import sql
import MySQLdb

import pymysql

In [42]:
# Make a connection
conn = "mongodb://localhost:27017"

# Making a Connection with MongoClient
client = MongoClient(conn)

# database
db = client.realestate_db

In [43]:
# data.reset_index(inplace=True)
collection = db.toronto
toronto_dict = toronto_df.to_dict("records")
collection.insert_many(toronto_dict)

In [44]:
collection = db.score
score_dict = score_df.to_dict("records")
collection.insert_many(score_dict)

In [45]:

engine = create_engine('mysql+pymysql://root:Myp@sswordis123@localhost/realestate_db', pool_recycle=3600)

In [46]:
engine.table_names()

['calgary', 'score', 'toronto']

In [47]:
toronto_df.to_sql(name="toronto", con=engine, if_exists="append", index=False)

In [48]:
score_df.to_sql(name="score", con=engine, if_exists="append", index=False)